<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Subsetting-and-Descriptive-Stats" data-toc-modified-id="Subsetting-and-Descriptive-Stats-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Subsetting and Descriptive Stats</a></span><ul class="toc-item"><li><span><a href="#Before-your-start:" data-toc-modified-id="Before-your-start:-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Before your start:</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Import-all-the-necessary-libraries-here:" data-toc-modified-id="Import-all-the-necessary-libraries-here:-1.1.0.1"><span class="toc-item-num">1.1.0.1&nbsp;&nbsp;</span>Import all the necessary libraries here:</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Challenge-1" data-toc-modified-id="Challenge-1-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Challenge 1</a></span><ul class="toc-item"><li><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#In-this-challenge-we-will-use-the-temp_states--dataset." data-toc-modified-id="In-this-challenge-we-will-use-the-temp_states--dataset.-2.0.0.1"><span class="toc-item-num">2.0.0.1&nbsp;&nbsp;</span>In this challenge we will use the <code>temp_states</code>  dataset.</a></span></li><li><span><a href="#First-import-it-into-a-dataframe-called-temp." data-toc-modified-id="First-import-it-into-a-dataframe-called-temp.-2.0.0.2"><span class="toc-item-num">2.0.0.2&nbsp;&nbsp;</span>First import it into a dataframe called <code>temp</code>.</a></span></li><li><span><a href="#Print-temp." data-toc-modified-id="Print-temp.-2.0.0.3"><span class="toc-item-num">2.0.0.3&nbsp;&nbsp;</span>Print <code>temp</code>.</a></span></li><li><span><a href="#Explore-the-data-types-of-the-temp-dataframe.-What-types-of-data-do-we-have?-Comment-your-result." data-toc-modified-id="Explore-the-data-types-of-the-temp-dataframe.-What-types-of-data-do-we-have?-Comment-your-result.-2.0.0.4"><span class="toc-item-num">2.0.0.4&nbsp;&nbsp;</span>Explore the data types of the <em>temp</em> dataframe. What types of data do we have? Comment your result.</a></span></li><li><span><a href="#Select-the-rows-where-state-is-New-York." data-toc-modified-id="Select-the-rows-where-state-is-New-York.-2.0.0.5"><span class="toc-item-num">2.0.0.5&nbsp;&nbsp;</span>Select the rows where state is New York.</a></span></li><li><span><a href="#What-is-the-average-temperature-of-cities-in-New-York?" data-toc-modified-id="What-is-the-average-temperature-of-cities-in-New-York?-2.0.0.6"><span class="toc-item-num">2.0.0.6&nbsp;&nbsp;</span>What is the average temperature of cities in New York?</a></span></li><li><span><a href="#Which-states-and-cities-have-a-temperature-above-15-degrees-Celsius?" data-toc-modified-id="Which-states-and-cities-have-a-temperature-above-15-degrees-Celsius?-2.0.0.7"><span class="toc-item-num">2.0.0.7&nbsp;&nbsp;</span>Which states and cities have a temperature above 15 degrees Celsius?</a></span></li><li><span><a href="#Now,-return-only-the-cities-that-have-a-temperature-above-15-degrees-Celsius." data-toc-modified-id="Now,-return-only-the-cities-that-have-a-temperature-above-15-degrees-Celsius.-2.0.0.8"><span class="toc-item-num">2.0.0.8&nbsp;&nbsp;</span>Now, return only the cities that have a temperature above 15 degrees Celsius.</a></span></li><li><span><a href="#Which-cities-have-a-temperature-above-15-degrees-Celcius-and-below-20-degrees-Celsius?" data-toc-modified-id="Which-cities-have-a-temperature-above-15-degrees-Celcius-and-below-20-degrees-Celsius?-2.0.0.9"><span class="toc-item-num">2.0.0.9&nbsp;&nbsp;</span>Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?</a></span></li><li><span><a href="#Find-the-mean-and-standard-deviation-of-the-temperature-of-each-state." data-toc-modified-id="Find-the-mean-and-standard-deviation-of-the-temperature-of-each-state.-2.0.0.10"><span class="toc-item-num">2.0.0.10&nbsp;&nbsp;</span>Find the mean and standard deviation of the temperature of each state.</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Challenge-2" data-toc-modified-id="Challenge-2-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Challenge 2</a></span><ul class="toc-item"><li><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Load-the-employees-dataset-into-a-dataframe.-Call-the-dataframe-employees." data-toc-modified-id="Load-the-employees-dataset-into-a-dataframe.-Call-the-dataframe-employees.-3.0.0.1"><span class="toc-item-num">3.0.0.1&nbsp;&nbsp;</span>Load the <code>employees</code> dataset into a dataframe. Call the dataframe <code>employees</code>.</a></span></li><li><span><a href="#Explore-the-data-types-of-the-employees-dataframe.-Comment-your-results." data-toc-modified-id="Explore-the-data-types-of-the-employees-dataframe.-Comment-your-results.-3.0.0.2"><span class="toc-item-num">3.0.0.2&nbsp;&nbsp;</span>Explore the data types of the <code>employees</code> dataframe. Comment your results.</a></span></li><li><span><a href="#What's-the-average-salary-in-this-company?" data-toc-modified-id="What's-the-average-salary-in-this-company?-3.0.0.3"><span class="toc-item-num">3.0.0.3&nbsp;&nbsp;</span>What's the average salary in this company?</a></span></li><li><span><a href="#What's-the-highest-salary?" data-toc-modified-id="What's-the-highest-salary?-3.0.0.4"><span class="toc-item-num">3.0.0.4&nbsp;&nbsp;</span>What's the highest salary?</a></span></li><li><span><a href="#What's-the-lowest-salary?" data-toc-modified-id="What's-the-lowest-salary?-3.0.0.5"><span class="toc-item-num">3.0.0.5&nbsp;&nbsp;</span>What's the lowest salary?</a></span></li><li><span><a href="#Who-are-the-employees-with-the-lowest-salary?" data-toc-modified-id="Who-are-the-employees-with-the-lowest-salary?-3.0.0.6"><span class="toc-item-num">3.0.0.6&nbsp;&nbsp;</span>Who are the employees with the lowest salary?</a></span></li><li><span><a href="#Find-all-the-information-about-an-employee-called-David." data-toc-modified-id="Find-all-the-information-about-an-employee-called-David.-3.0.0.7"><span class="toc-item-num">3.0.0.7&nbsp;&nbsp;</span>Find all the information about an employee called David.</a></span></li><li><span><a href="#Could-you-return-only-David's-salary?" data-toc-modified-id="Could-you-return-only-David's-salary?-3.0.0.8"><span class="toc-item-num">3.0.0.8&nbsp;&nbsp;</span>Could you return only David's salary?</a></span></li><li><span><a href="#Print-all-the-rows-where-job-title-is-associate." data-toc-modified-id="Print-all-the-rows-where-job-title-is-associate.-3.0.0.9"><span class="toc-item-num">3.0.0.9&nbsp;&nbsp;</span>Print all the rows where job title is associate.</a></span></li><li><span><a href="#Print-the-first-3-rows-of-your-dataframe." data-toc-modified-id="Print-the-first-3-rows-of-your-dataframe.-3.0.0.10"><span class="toc-item-num">3.0.0.10&nbsp;&nbsp;</span>Print the first 3 rows of your dataframe.</a></span></li><li><span><a href="#Find-the-employees-whose-title-is-associate-and-whose-salary-is-above-55." data-toc-modified-id="Find-the-employees-whose-title-is-associate-and-whose-salary-is-above-55.-3.0.0.11"><span class="toc-item-num">3.0.0.11&nbsp;&nbsp;</span>Find the employees whose title is associate and whose salary is above 55.</a></span></li><li><span><a href="#Group-the-employees-by-number-of-years-of-employment.-What-are-the-average-salaries-in-each-group?" data-toc-modified-id="Group-the-employees-by-number-of-years-of-employment.-What-are-the-average-salaries-in-each-group?-3.0.0.12"><span class="toc-item-num">3.0.0.12&nbsp;&nbsp;</span>Group the employees by number of years of employment. What are the average salaries in each group?</a></span></li><li><span><a href="#What-is-the-average-salary-per-title?" data-toc-modified-id="What-is-the-average-salary-per-title?-3.0.0.13"><span class="toc-item-num">3.0.0.13&nbsp;&nbsp;</span>What is the average salary per title?</a></span></li><li><span><a href="#Find-the-salary-quartiles." data-toc-modified-id="Find-the-salary-quartiles.-3.0.0.14"><span class="toc-item-num">3.0.0.14&nbsp;&nbsp;</span>Find the salary quartiles.</a></span></li><li><span><a href="#Is-the-mean-salary-different-per-gender?" data-toc-modified-id="Is-the-mean-salary-different-per-gender?-3.0.0.15"><span class="toc-item-num">3.0.0.15&nbsp;&nbsp;</span>Is the mean salary different per gender?</a></span></li><li><span><a href="#Find-the-minimum,-mean-and-maximum-of-all-numeric-columns-for-each-company-department." data-toc-modified-id="Find-the-minimum,-mean-and-maximum-of-all-numeric-columns-for-each-company-department.-3.0.0.16"><span class="toc-item-num">3.0.0.16&nbsp;&nbsp;</span>Find the minimum, mean and maximum of all numeric columns for each company department.</a></span></li><li><span><a href="#Bonus-Question:--for-each-department,-compute-the-difference-between-the-maximum-and-the-minimum-salary." data-toc-modified-id="Bonus-Question:--for-each-department,-compute-the-difference-between-the-maximum-and-the-minimum-salary.-3.0.0.17"><span class="toc-item-num">3.0.0.17&nbsp;&nbsp;</span>Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Challenge-3" data-toc-modified-id="Challenge-3-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Challenge 3</a></span><ul class="toc-item"><li><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Open-the-orders-dataset.-Name-your-dataset-orders." data-toc-modified-id="Open-the-orders-dataset.-Name-your-dataset-orders.-4.0.0.1"><span class="toc-item-num">4.0.0.1&nbsp;&nbsp;</span>Open the <code>orders</code> dataset. Name your dataset <code>orders</code>.</a></span></li><li><span><a href="#Explore-your-dataset-by-looking-at-the-data-types-and-summary-statistics.-Comment-your-results." data-toc-modified-id="Explore-your-dataset-by-looking-at-the-data-types-and-summary-statistics.-Comment-your-results.-4.0.0.2"><span class="toc-item-num">4.0.0.2&nbsp;&nbsp;</span>Explore your dataset by looking at the data types and summary statistics. Comment your results.</a></span></li><li><span><a href="#What-is-the-average-purchase-price?" data-toc-modified-id="What-is-the-average-purchase-price?-4.0.0.3"><span class="toc-item-num">4.0.0.3&nbsp;&nbsp;</span>What is the average purchase price?</a></span></li><li><span><a href="#What-are-the-highest-and-lowest-purchase-prices?" data-toc-modified-id="What-are-the-highest-and-lowest-purchase-prices?-4.0.0.4"><span class="toc-item-num">4.0.0.4&nbsp;&nbsp;</span>What are the highest and lowest purchase prices?</a></span></li><li><span><a href="#Select-all-the-customers-from-Spain." data-toc-modified-id="Select-all-the-customers-from-Spain.-4.0.0.5"><span class="toc-item-num">4.0.0.5&nbsp;&nbsp;</span>Select all the customers from Spain.</a></span></li><li><span><a href="#How-many-customers-do-we-have-in-Spain?" data-toc-modified-id="How-many-customers-do-we-have-in-Spain?-4.0.0.6"><span class="toc-item-num">4.0.0.6&nbsp;&nbsp;</span>How many customers do we have in Spain?</a></span></li><li><span><a href="#Select-all-the-customers-who-have-bought-more-than-50-items." data-toc-modified-id="Select-all-the-customers-who-have-bought-more-than-50-items.-4.0.0.7"><span class="toc-item-num">4.0.0.7&nbsp;&nbsp;</span>Select all the customers who have bought more than 50 items.</a></span></li><li><span><a href="#Select-orders-from-Spain-that-include-more-than-50-items." data-toc-modified-id="Select-orders-from-Spain-that-include-more-than-50-items.-4.0.0.8"><span class="toc-item-num">4.0.0.8&nbsp;&nbsp;</span>Select orders from Spain that include more than 50 items.</a></span></li><li><span><a href="#Select-all-free-orders." data-toc-modified-id="Select-all-free-orders.-4.0.0.9"><span class="toc-item-num">4.0.0.9&nbsp;&nbsp;</span>Select all free orders.</a></span></li><li><span><a href="#Select-all-orders-whose-description-starts-with-lunch-bag." data-toc-modified-id="Select-all-orders-whose-description-starts-with-lunch-bag.-4.0.0.10"><span class="toc-item-num">4.0.0.10&nbsp;&nbsp;</span>Select all orders whose description starts with <code>lunch bag</code>.</a></span></li><li><span><a href="#Select-all-lunch-bag-orders-made-in-2011." data-toc-modified-id="Select-all-lunch-bag-orders-made-in-2011.-4.0.0.11"><span class="toc-item-num">4.0.0.11&nbsp;&nbsp;</span>Select all <code>lunch bag</code> orders made in 2011.</a></span></li><li><span><a href="#Show-the-frequency-distribution-of-the-amount-spent-in-Spain." data-toc-modified-id="Show-the-frequency-distribution-of-the-amount-spent-in-Spain.-4.0.0.12"><span class="toc-item-num">4.0.0.12&nbsp;&nbsp;</span>Show the frequency distribution of the amount spent in Spain.</a></span></li><li><span><a href="#Select-all-orders-made-in-the-month-of-August." data-toc-modified-id="Select-all-orders-made-in-the-month-of-August.-4.0.0.13"><span class="toc-item-num">4.0.0.13&nbsp;&nbsp;</span>Select all orders made in the month of August.</a></span></li><li><span><a href="#Find-the-number-of-orders-made-by-each-country-in-the-month-of-August." data-toc-modified-id="Find-the-number-of-orders-made-by-each-country-in-the-month-of-August.-4.0.0.14"><span class="toc-item-num">4.0.0.14&nbsp;&nbsp;</span>Find the number of orders made by each country in the month of August.</a></span></li><li><span><a href="#What's-the--average-amount-of-money-spent-by-country?" data-toc-modified-id="What's-the--average-amount-of-money-spent-by-country?-4.0.0.15"><span class="toc-item-num">4.0.0.15&nbsp;&nbsp;</span>What's the  average amount of money spent by country?</a></span></li><li><span><a href="#What's-the-most-expensive-item?" data-toc-modified-id="What's-the-most-expensive-item?-4.0.0.16"><span class="toc-item-num">4.0.0.16&nbsp;&nbsp;</span>What's the most expensive item?</a></span></li><li><span><a href="#What-is-the-average-amount-spent-per-year?" data-toc-modified-id="What-is-the-average-amount-spent-per-year?-4.0.0.17"><span class="toc-item-num">4.0.0.17&nbsp;&nbsp;</span>What is the average amount spent per year?</a></span></li></ul></li></ul></li></ul></li></ul></div>

# Subsetting and Descriptive Stats

## Before your start:
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import pandas as pd

# Challenge 1
#### In this challenge we will use the `temp_states`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
temp = pd.read_csv('temp_states.txt')

#### Print `temp`.

In [4]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [13]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
We have 2 objects and one float.

#### Select the rows where state is New York.

In [16]:
ny = temp.loc[temp['State'] == 'New York']
ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [19]:
temp.loc[temp['State']=='New York'].mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [20]:
temp.loc[temp['Temperature']>15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [21]:
temp['City'].loc[temp['Temperature']<15]

1        Albany
2       Buffalo
4    Bridgeport
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [28]:
temp['City'].loc[((temp['Temperature']>15) & (temp['Temperature']<20))]

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [31]:
group_temp = temp.groupby("State")
mean_state = group_temp.mean()
mean_state = mean_state.reset_index()
mean_state

         State  Temperature
0  Connecticut    15.833333
1   New Jersey    21.111111
2     New York    10.740741

# Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [35]:
employees = pd.read_csv('employee.txt')
employees.head(5)

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### Explore the data types of the `employees` dataframe. Comment your results.

In [38]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

5 objects and 2 integer

#### What's the average salary in this company?

In [39]:
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [40]:
employees['Salary'].max()

70

#### What's the lowest salary?

In [41]:
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [44]:
employees.sort_values('Salary').head(5)

     Name Department Education Gender      Title  Years  Salary
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
0    Jose         IT  Bachelor      M    analyst      1      35
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### Find all the information about an employee called David.

In [45]:
employees.loc[employees['Name']=='David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [46]:
employees['Salary'].loc[employees['Name']=='David']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [47]:
employees.loc[employees['Title']=='associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [48]:
# Method 1
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [50]:
# Method 2
employees.loc[employees.index<3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [54]:
employees.loc[((employees['Title']== 'associate') & (employees['Salary']>55))]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [55]:
group_emp = employees.groupby("Years")
mean_emp = group_emp.mean()
mean_emp = mean_emp.reset_index()
mean_emp

   Years     Salary
0      1  35.000000
1      2  38.333333
2      3  55.000000
3      4  35.000000
4      7  60.000000
5      8  70.000000

####  What is the average salary per title?

In [57]:
group_emp = employees.groupby("Title")
mean_emp = group_emp.mean()
mean_emp = mean_emp.reset_index()
mean_emp

       Title  Years     Salary
0         VP   8.00  70.000000
1    analyst   2.25  32.500000
2  associate   4.00  56.666667

####  Find the salary quartiles.

In [60]:
employees.Salary.quantile([0.25,0.5,0.75])

0.25    35.0
0.50    55.0
0.75    60.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [61]:
group_emp = employees.groupby("Gender")
mean_emp = group_emp.mean()
mean_emp = mean_emp.reset_index()
mean_emp

  Gender  Years  Salary
0      F    4.0    47.5
1      M    4.2    50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [79]:
group_emp = employees.groupby('Department')
group_emp.describe()

           Years                                                Salary         \
           count      mean       std  min   25%  50%   75%  max  count   mean
Department
HR           3.0  4.666667  3.055050  2.0  3.00  4.0  6.00  8.0    3.0  45.00
IT           4.0  4.500000  3.511885  1.0  1.75  4.5  7.25  8.0    4.0  48.75
Sales        2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0    2.0  55.00


                  std   min    25%   50%   75%   max
Department
HR          21.794495  30.0  32.50  35.0  52.5  70.0
IT          19.311050  30.0  33.75  47.5  62.5  70.0
Sales        0.000000  55.0  55.00  55.0  55.0  55.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

# Challenge 3
#### Open the `orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here